---
kind: type
id: T:Autodesk.Revit.DB.WorksetConfigurationOption
source: html/2fe5f0c1-c4c7-ea97-541c-5ee61b397dce.htm
---
# Autodesk.Revit.DB.WorksetConfigurationOption

A collection of options used to initialize a WorksetConfiguration.

## Syntax (C#)
```csharp
public enum WorksetConfigurationOption
```